# Используем официальный образ Python на базе slim для минимального размера
FROM python:3.12-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями
COPY requirements.txt .

# Устанавливаем зависимости
# --no-cache-dir уменьшает размер образа
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь остальной код проекта в контейнер
COPY . .

# Создаем директорию для данных (она будет использоваться для тома)
RUN mkdir -p /data

# Указываем команду для запуска вашего бота
CMD ["python", "main.py"]